import pandas as pd
import pytest
import datetime


@pytest.fixture
def get_data_for_services():
    """Фикстура возвращает DataFrame с транзакциями"""
    return [
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-160,89",
            "Валюта операции": "RUB",
            "Сумма платежа": "-160,89",
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5411,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 3.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-160,89",
            "Валюта операции": "RUB",
            "Сумма платежа": "-160,89",
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5411,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 3.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-160,89",
            "Валюта операции": "RUB",
            "Сумма платежа": "-160,89",
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Различные товары",
            "MCC": 5411,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 3.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-160,89",
            "Валюта операции": "RUB",
            "Сумма платежа": "-160,89",
            "Валюта платежа": "RUB",
            "Кэшбэк": 70,
            "Категория": "Ж/д билеты",
            "MCC": 5411,
            "Описание": "РЖД",
            "Бонусы (включая кэшбэк)": 3.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.89,
        },
    ]


@pytest.fixture
def get_data_for_reports():
    """Фикстура возвращает DataFrame с транзакциями"""
    return pd.DataFrame(
        [
            {
                "Дата операции": "31.12.2020 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Колхоз",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "28.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "31.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "30.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 70,
                "Категория": "Ж/д билеты",
                "MCC": 5411,
                "Описание": "РЖД",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
        ]
    )


@pytest.fixture
def get_now_data_for_reports():
    """Фикстура возвращает операции с текущими датами и текущую дату"""
    date_in_operation = datetime.datetime.now()
    date_in_operation_str = date_in_operation.strftime('%d.%m.%Y %H:%M:%S')

    date_in_arg = datetime.datetime.now()

    return date_in_arg, pd.DataFrame(
        [
            {
                "Дата операции": date_in_operation_str,
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "31.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
        ]
    )
