import pandas as pd
import pytest
import datetime


@pytest.fixture
def get_data_for_services():
    """Фикстура возвращает DataFrame с транзакциями"""
    return [
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-160,89",
            "Валюта операции": "RUB",
            "Сумма платежа": "-160,89",
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5411,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 3.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-160,89",
            "Валюта операции": "RUB",
            "Сумма платежа": "-160,89",
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5411,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 3.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-160,89",
            "Валюта операции": "RUB",
            "Сумма платежа": "-160,89",
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Различные товары",
            "MCC": 5411,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 3.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-160,89",
            "Валюта операции": "RUB",
            "Сумма платежа": "-160,89",
            "Валюта платежа": "RUB",
            "Кэшбэк": 70,
            "Категория": "Ж/д билеты",
            "MCC": 5411,
            "Описание": "РЖД",
            "Бонусы (включая кэшбэк)": 3.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.89,
        },
    ]


@pytest.fixture
def get_data_for_reports():
    """Фикстура возвращает DataFrame с транзакциями"""
    return pd.DataFrame(
        [
            {
                "Дата операции": "31.12.2020 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Колхоз",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "28.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "31.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "30.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 70,
                "Категория": "Ж/д билеты",
                "MCC": 5411,
                "Описание": "РЖД",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
        ]
    )


@pytest.fixture
def get_now_data_for_reports():
    """Фикстура возвращает операции с текущими датами и текущую дату"""
    date_in_operation = datetime.datetime.now()
    date_in_operation_str = date_in_operation.strftime('%d.%m.%Y %H:%M:%S')

    date_in_arg = datetime.datetime.now()

    return date_in_arg, pd.DataFrame(
        [
            {
                "Дата операции": date_in_operation_str,
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "31.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
        ]
    )


@pytest.fixture
def get_data_for_get_expenses():
    """Фикстура возвращает операции для расходов, пополнений и наличных"""
    return pd.DataFrame(
        [
            {
                "Дата операции": "31.12.2021 16:44:00",
                "Сумма операции": -160.00,
                "Категория": "Супермаркеты",
                "Описание": "Магнит",
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "28.12.2021 16:44:00",
                "Сумма операции": -200.00,
                "Категория": "Супермаркеты",
                "Описание": "Магнит",
                "Сумма операции с округлением": 200.01,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -320.00,
                "Категория": "Супермаркеты",
                "Описание": "Магнит",
                "Сумма операции с округлением": 320.11,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -150.00,
                "Категория": "Различные товары",
                "Описание": "Ozon.ru",
                "Сумма операции с округлением": 150.11,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -170.00,
                "Категория": "Каршеринг",
                "Описание": "Ситидрайв",
                "Сумма операции с округлением": 170.11,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -330.00,
                "Категория": "Ж/д билеты",
                "Описание": "РЖД",
                "Сумма операции с округлением": 330.11,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -296.00,
                "Категория": "Фастфуд",
                "Описание": "Mouse Tail",
                "Сумма операции с округлением": 296.11,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -3250.00,
                "Категория": "Дом и ремонт",
                "Описание": "Леруа Мерлен",
                "Сумма операции с округлением": 3250.11,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -140.00,
                "Категория": "Аптеки",
                "Описание": "Классика",
                "Сумма операции с округлением": 140.11,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -225.00,
                "Категория": "Связь",
                "Описание": "МТС ",
                "Сумма операции с округлением": 225.11,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -120.00,
                "Категория": "Цветы",
                "Описание": "FanFan Tulpan",
                "Сумма операции с округлением": 120.02,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -3000.00,
                "Категория": "Наличные",
                "Описание": "Снятие в банкомате Тинькофф",
                "Сумма операции с округлением": 3000.00,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -5000.00,
                "Категория": "Наличные",
                "Описание": "Снятие в банкомате Тинькофф",
                "Сумма операции с округлением": 5000.00,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -250.00,
                "Категория": "Переводы",
                "Описание": "Константин Л.",
                "Сумма операции с округлением": 250.05,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Сумма операции": -3000.00,
                "Категория": "Переводы",
                "Описание": "Константин Л.",
                "Сумма операции с округлением": 3000.00,
            },
        ]
    )


@pytest.fixture
def get_data_for_get_income():
    """Фикстура возвращает операции для поступлений"""
    return pd.DataFrame(
        [
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Категория": "Пополнения",
                "Описание": "Пополнение через Газпромбанк",
                "Сумма операции с округлением": 3000.00,
            },
            {
                "Дата операции": "30.12.2021 16:44:00",
                "Категория": "Пополнения",
                "Описание": "Пополнение через Газпромбанк",
                "Сумма операции с округлением": 5000.00,
            },
            {
                "Дата операции": "29.12.2021 16:44:00",
                "Категория": "Пополнения",
                "Описание": "Пополнение через Сбер",
                "Сумма операции с округлением": 200.01,
            },
            {
                "Дата операции": "30.12.2021 16:44:00",
                "Категория": "Пополнения",
                "Описание": "Пополнение через Сбер",
                "Сумма операции с округлением": 1000.00,
            },
        ]
    )
