import pandas as pd
import pytest
import datetime


@pytest.fixture
def get_data_for_services():
    """Фикстура возвращает DataFrame с транзакциями"""
    return [
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-160,89",
            "Валюта операции": "RUB",
            "Сумма платежа": "-160,89",
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5411,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 3.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-160,89",
            "Валюта операции": "RUB",
            "Сумма платежа": "-160,89",
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5411,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 3.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-160,89",
            "Валюта операции": "RUB",
            "Сумма платежа": "-160,89",
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Различные товары",
            "MCC": 5411,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 3.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-160,89",
            "Валюта операции": "RUB",
            "Сумма платежа": "-160,89",
            "Валюта платежа": "RUB",
            "Кэшбэк": 70,
            "Категория": "Ж/д билеты",
            "MCC": 5411,
            "Описание": "РЖД",
            "Бонусы (включая кэшбэк)": 3.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.89,
        },
    ]


@pytest.fixture
def get_data_for_reports():
    """Фикстура возвращает DataFrame с транзакциями"""
    return pd.DataFrame(
        [
            {
                "Дата операции": "31.12.2020 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Колхоз",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "28.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "31.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "30.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 70,
                "Категория": "Ж/д билеты",
                "MCC": 5411,
                "Описание": "РЖД",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
        ]
    )


@pytest.fixture
def get_now_data_for_reports():
    """Фикстура возвращает операции с текущими датами и текущую дату"""
    date_in_operation = datetime.datetime.now()
    date_in_operation_str = date_in_operation.strftime('%d.%m.%Y %H:%M:%S')

    date_in_arg = datetime.datetime.now()

    return date_in_arg, pd.DataFrame(
        [
            {
                "Дата операции": date_in_operation_str,
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
            {
                "Дата операции": "31.12.2021 16:44:00",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": "-160,89",
                "Валюта операции": "RUB",
                "Сумма платежа": "-160,89",
                "Валюта платежа": "RUB",
                "Кэшбэк": 0,
                "Категория": "Супермаркеты",
                "MCC": 5411,
                "Описание": "Магнит",
                "Бонусы (включая кэшбэк)": 3.00,
                "Округление на инвесткопилку": 0.0,
                "Сумма операции с округлением": 160.89,
            },
        ]
    )


@pytest.fixture
def get_data_for_get_expenses():
    """Фикстура возвращает операции для расходов и период дат"""
    return {
        'operations': pd.DataFrame(
            [
                {
                    "Дата операции": "31.12.2021 16:44:00",
                    "Категория": "Супермаркеты",
                    "Сумма операции с округлением": 160.89,
                },
                {
                    "Дата операции": "28.12.2021 16:44:00",
                    "Категория": "Супермаркеты",
                    "Сумма операции с округлением": 200.01,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Супермаркеты",
                    "Сумма операции с округлением": 320.11,
                },
                {
                    "Дата операции": "29.12.2020 16:44:00",
                    "Категория": "Супермаркеты",
                    "Сумма операции с округлением": 160.89,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Различные товары",
                    "Сумма операции с округлением": 150.11,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Каршеринг",
                    "Сумма операции с округлением": 170.11,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Ж/д билеты",
                    "Сумма операции с округлением": 330.11,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Фастфуд",
                    "Сумма операции с округлением": 296.11,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Дом и ремонт",
                    "Сумма операции с округлением": 3250.11,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Аптеки",
                    "Сумма операции с округлением": 140.11,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Связь",
                    "Сумма операции с округлением": 225.11,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Цветы",
                    "Сумма операции с округлением": 120.02,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Наличные",
                    "Сумма операции с округлением": 3000.00,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Наличные",
                    "Сумма операции с округлением": 5000.00,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Переводы",
                    "Сумма операции с округлением": 250.05,
                },
                {
                    "Дата операции": "29.12.2021 16:44:00",
                    "Категория": "Переводы",
                    "Сумма операции с округлением": 3000.00,
                },
            ]
        ),
        'start_date': datetime.datetime(2021, 12, 1, 00, 00, 00),
        'end_date': datetime.datetime(2021, 12, 31, 23, 59, 59),
    }
